package gb.myhomework.mypreference.model

object Repository {
    private val games: List<Game>

    init {
        games = listOf(
                Game(
                        "Первая игра: победа Коли",
                        "Николай",
                        "Константин",
                        "Екатерина",
                        "Надежда",
                        300,
                        100,
                        -300,
                        -100
                ),
                Game(
                        "Вторая игра: Катя всех сделала",
                        "Николай",
                        "Константин",
                        "Екатерина",
                        "Надежда",
                        -300,
                        -300,
                        1000,
                        -400
                ),
                Game(
                        "Третья игра: Костя, как же так? Мизер с такими не играют!",
                        "Николай",
                        "Константин",
                        "Екатерина",
                        "Надежда",
                        300,
                        -1000,
                        300,
                        400
                )
        )
    }

    fun getGames(): List<Game> = games

}